# Sample data creator for the DB Project
This was copied from something I had done for an earlier assignment.

In [11]:
%pip install Faker

Requirement already satisfied: Faker in /usr/local/python/3.10.13/lib/python3.10/site-packages (24.4.0)
Requirement already satisfied: python-dateutil>=2.4 in /home/codespace/.local/lib/python3.10/site-packages (from Faker) (2.9.0.post0)
Requirement already satisfied: six>=1.5 in /home/codespace/.local/lib/python3.10/site-packages (from python-dateutil>=2.4->Faker) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

## Overall Structure
This section sets up the output for creating insert SQL statement data.

In [5]:
"""
Created on: February 14, 2024

Author: Tuck Williamson

Assignment: 601 Misc\Library
=============
This module creates fake data for testing purposes.
"""

from faker import Faker
import typing
from jinja2 import Template as TP

# This makes results repeatable.
Faker.seed(601)
fake = Faker("en_US")

sqlQuote = "'"
sqteJoin = ", "

INS_TP = TP(
    """
{% set fields = "" if fields is none else '('+ ', '.join(fields) +')' %}
{% if genComments %}
------------------------------
-- {{table}}
------------------------------
{% endif %}
{% if genTransaction %}
BEGIN;            
{% endif %}
{% if genDelete is not false %}DELETE
	FROM {{table}}
	WHERE {{genDelete}} IS NOT NULL;
{% endif %}
INSERT INTO {{table}}{{fields}}
	VALUES {{ elements|join(',\n\t\t')}}
        ;
{% if genTransaction %}
COMMIT;            
{% endif %}
{% if genComments %}
------------------------------
{% endif %}
\n\n
"""
)


def create_sql_insert(
    elements: typing.Iterable[typing.Iterable[str]],
    table: str,
    fields: typing.Iterable[str] = None,
    genDelete: bool | str = False,
    genTransaction: bool = False,
    genComments: bool = True,
) -> str:
    """
    This creates a **SQL INSERT** statement given the elements and table name.
    Fields can also be specified as an array of strings in the order they
    were placed in the tuples in the elements list.

    :param elements: The elements to inject as values into the table. Any elements that
    :param table: The name of the table to insert into.
    :param fields: An optional list of fields names in the order that they were placed in the elements list items.
    :param genDelete: An optional boolean which determines if a delete statement is included before the insert statement.
        If genDelete is a string it is used as the attribute to test for not null.
        If genDelete is True then it uses the first field in fields as the test attribute.
    :param genComments: An optional boolean which determines if comments are added to the output.
    :return: A string containing the sql for the insert statement.

    """
    # retVal = ""
    match genDelete:
        case str(delOnField):
            genDelete = delOnField
        case True:
            assert fields is not None
            genDelete = fields[0]

    elements = [
        "({row})".format(
            row=", ".join(
                [f"'{val}'" if not val.startswith("raw: ") else val[5:] for val in ele]
            )
        )
        for ele in elements
    ]

    return INS_TP.render(
        elements=elements,
        table=table,
        fields=fields,
        genDelete=genDelete,
        genTransaction=genTransaction,
        genComments=genComments,
    ).strip()

In [2]:
from collections import OrderedDict
import matplotlib
import matplotlib.pyplot
from numpy import array
import math

posList = [
    "Executive Chef",
    "Manager",
    "Sommelier",
    "Sous Chef",
    "Pastry Chef",
    "Roast Chef",
    "Captain",
    "Bartender",
    "Hosts",
    "Waiter",
    "Runner",
    "Back Waiter",
    "Barback",
    "Busboy",
]

# This is just giving weights to the positions based on how common they are.
# plen = len(posList)
# weights = array([float(idx-(plen/2.0)+0.1)/plen for idx in range(len(posList))])
# weights = array([(math.sin(math.pi*val)+1)**3 for val in weights])
# # weights = array([float(idx-(plen/2.0))/plen for idx in range(len(posList))])
# matplotlib.pyplot.plot(posList,weights).show()
weights = array([0, 0, 0, 5, 5, 10, 10, 5, 10, 25, 5, 5, 5, 5]) / 100.0
weights /= sum(weights)
# display(weights)
numEmployees = 90


def getEmp(position=None) -> tuple[str, str, str, str, str, str]:
    if position is None:
        position = fake.random_element(
            OrderedDict([(posList[idx], weights[idx]) for idx in range(len(posList))])
        )
    return (
        fake.numerify("#########"),
        fake.first_name(),
        fake.last_name(),
        str(fake.past_date("-5y")),
        fake.numerify("##########"),
        position,
    )


emps = [getEmp() for i in range(numEmployees)]
# An exec chef
emps.append(getEmp(posList[0]))
# num managers
[emps.append(getEmp(posList[1])) for i in range(4)]
# num sommlier
[emps.append(getEmp(posList[2])) for i in range(3)]

# print(f'{"-"*30}\n-- Employees')
print(create_sql_insert(emps, "thebestdbever.employee", genDelete="SSN"))
# print(f'{"-"*30}\n')

positionIndex = -1
emplIDs = [emp[0] for emp in emps]
empPosMap = {}
for pos in posList:
    # Build a map of positions -> []
    empPosMap[pos] = []

for emp in emps:
    # Build a map of positions -> [employee SSNs]
    empPosMap[emp[positionIndex]].append(emp[0])

------------------------------
-- thebestdbever.employee
------------------------------


DELETE
	FROM thebestdbever.employee
	WHERE SSN IS NOT NULL;

INSERT INTO thebestdbever.employee
	VALUES ('980176700', 'Maria', 'Howard', '2022-08-09', '9853375846', 'Roast Chef'),
		('337063900', 'Emily', 'Myers', '2021-10-22', '3947811314', 'Waiter'),
		('957390053', 'Mark', 'Boyle', '2021-06-13', '9051490354', 'Waiter'),
		('845824577', 'Denise', 'Castillo', '2020-01-17', '3383837190', 'Waiter'),
		('438315184', 'Morgan', 'Goodman', '2022-04-29', '2938320955', 'Waiter'),
		('709351526', 'April', 'Hardy', '2023-08-17', '3888523767', 'Roast Chef'),
		('209497253', 'Jason', 'Bauer', '2020-10-30', '5691746431', 'Sous Chef'),
		('443324088', 'Jonathan', 'Perez', '2021-04-12', '3380655566', 'Waiter'),
		('818508427', 'Diane', 'Graham', '2021-06-30', '8817601062', 'Waiter'),
		('559694621', 'Arthur', 'Holloway', '2022-12-25', '5182790698', 'Barback'),
		('727992852', 'Kerri', 'Mendoza', '2020-10-28', '1080702796', 'Waiter'),
		('228238223', 'Ian', 'Freeman', '2021-01-18', '2266793685', 'Hosts'),
		('196669355', 'Susan', 'James', '2022-07-25', '4362748613', 'Runner'),
		('773922208', 'Daniel', 'Smith', '2019-07-21', '9892094998', 'Sous Chef'),
		('773895317', 'Katie', 'Caldwell', '2023-11-26', '9109825675', 'Waiter'),
		('079301349', 'Sandra', 'White', '2020-02-12', '4272370504', 'Roast Chef'),
		('604444800', 'Daniel', 'Powell', '2024-03-08', '3162989882', 'Roast Chef'),
		('312993563', 'Jennifer', 'Smith', '2020-01-22', '2430513956', 'Captain'),
		('933700700', 'Kimberly', 'Perkins', '2020-02-27', '0287947996', 'Barback'),
		('512350123', 'Jay', 'Osborne', '2023-03-08', '5874309403', 'Barback'),
		('227791004', 'Brittney', 'Landry', '2020-12-05', '5226385387', 'Runner'),
		('961235118', 'Michael', 'Hull', '2020-08-14', '6872552229', 'Waiter'),
		('569080662', 'Jeremy', 'Chan', '2022-07-03', '5900976581', 'Barback'),
		('359404567', 'Travis', 'Davis', '2022-09-30', '4617122509', 'Hosts'),
		('207951523', 'Danielle', 'Newman', '2020-04-02', '5380162502', 'Waiter'),
		('181290694', 'Lori', 'Galloway', '2021-06-07', '9850217006', 'Captain'),
		('282420502', 'Nathan', 'Lewis', '2021-12-31', '1715620850', 'Waiter'),
		('382483089', 'Kara', 'Barnes', '2022-02-24', '5915629976', 'Sous Chef'),
		('163081250', 'Donald', 'Wells', '2020-07-06', '1124444537', 'Waiter'),
		('626483508', 'Taylor', 'Rose', '2020-10-08', '6939539347', 'Runner'),
		('694952163', 'Kayla', 'Smith', '2020-12-14', '3902650998', 'Pastry Chef'),
		('460366767', 'Renee', 'Parker', '2021-06-06', '2427075283', 'Waiter'),
		('549218587', 'Rebecca', 'Martinez', '2020-09-26', '1638097058', 'Roast Chef'),
		('915952606', 'Matthew', 'Swanson', '2020-01-14', '4950457952', 'Waiter'),
		('922853432', 'Matthew', 'Kim', '2021-12-13', '4174785774', 'Waiter'),
		('603287983', 'John', 'Marsh', '2020-08-30', '6450423352', 'Roast Chef'),
		('868297051', 'Deborah', 'Shelton', '2022-01-11', '0082644278', 'Waiter'),
		('570564619', 'Selena', 'Jones', '2022-09-30', '5212873016', 'Waiter'),
		('608875084', 'Crystal', 'Nelson', '2023-10-28', '9138416853', 'Sous Chef'),
		('750826949', 'Cynthia', 'Sandoval', '2023-07-12', '1498392705', 'Pastry Chef'),
		('987566801', 'Jesse', 'Hart', '2020-03-10', '9901339676', 'Runner'),
		('395875054', 'Kyle', 'Thomas', '2019-08-15', '0112541738', 'Sous Chef'),
		('035994879', 'James', 'Willis', '2019-09-03', '6934195865', 'Hosts'),
		('191197193', 'William', 'Gardner', '2023-10-15', '0858077702', 'Waiter'),
		('509198386', 'Evan', 'Green', '2022-12-08', '8196639952', 'Sous Chef'),
		('923427923', 'Laura', 'Miller', '2019-07-18', '8600656615', 'Hosts'),
		('077238802', 'Henry', 'Sparks', '2024-02-28', '2423210994', 'Pastry Chef'),
		('038223326', 'Christian', 'Carroll', '2020-03-24', '4887623562', 'Sous Chef'),
		('454996158', 'Bonnie', 'Williams', '2019-08-22', '0330934892', 'Hosts'),
		('298398393', 'Jennifer', 'Johnson', '2019-10-26', '1185774880', 'Captain'),
		('881090008', 'Reginald', 'Fisher', '2022-04-12', '4121824715', 'Back Waiter'),
		('105399228', 'Zachary', 'Harper', '2022-07-17', '5929947625', 'Captain'),
		('070606847', 'James', 'Carey', '2020-04-20', '1105871396', 'Hosts'),
		('356026873', 'Kevin', 'Chandler', '2020-12-06', '5996539033', 'Waiter'),
		('413494654', 'Stacie', 'Phelps', '2021-01-02', '9069715348', 'Waiter'),
		('527276037', 'Elizabeth', 'Chavez', '2023-10-17', '5515799081', 'Waiter'),
		('431546005', 'Larry', 'Suarez', '2021-11-20', '0136439889', 'Runner'),
		('290980577', 'Michelle', 'Taylor', '2020-03-23', '1954550109', 'Back Waiter'),
		('612657236', 'Chris', 'Andrews', '2021-07-04', '1951610572', 'Bartender'),
		('776644943', 'Casey', 'Fleming', '2023-06-21', '2646002471', 'Roast Chef'),
		('741748404', 'Adam', 'Mckee', '2019-12-22', '4662385028', 'Hosts'),
		('788324562', 'Brenda', 'Green', '2023-02-01', '0698062480', 'Runner'),
		('020015538', 'Michael', 'Winters', '2022-12-16', '1440060704', 'Captain'),
		('285189828', 'Jessica', 'Brewer', '2020-03-19', '5706422116', 'Roast Chef'),
		('225735404', 'Kevin', 'Gallagher', '2022-03-18', '6779548234', 'Hosts'),
		('050101581', 'Brad', 'Martin', '2024-01-25', '3032350014', 'Waiter'),
		('250264699', 'Chris', 'Brown', '2019-12-28', '8576704481', 'Roast Chef'),
		('296057908', 'Helen', 'Obrien', '2020-09-18', '7893688936', 'Barback'),
		('413533939', 'Carrie', 'Delgado', '2022-05-10', '6234995171', 'Barback'),
		('091554149', 'Joshua', 'Mullins', '2022-11-17', '9189759378', 'Sous Chef'),
		('353175331', 'Daniel', 'Shaw', '2021-05-20', '2163156057', 'Waiter'),
		('998847352', 'Andrew', 'Lawson', '2020-11-07', '3854112235', 'Waiter'),
		('908354208', 'Amber', 'Reed', '2021-07-07', '9648482909', 'Captain'),
		('606035342', 'Andrew', 'Coleman', '2021-09-27', '0507734605', 'Pastry Chef'),
		('660757419', 'Gina', 'Blake', '2021-07-26', '3699517470', 'Waiter'),
		('002738355', 'Dawn', 'Garrett', '2019-10-03', '6920584918', 'Sous Chef'),
		('801737668', 'Rebecca', 'Johnson', '2020-02-05', '7153128929', 'Waiter'),
		('799995205', 'Joseph', 'Hill', '2020-12-13', '9619326543', 'Waiter'),
		('048017726', 'Maria', 'Noble', '2021-01-27', '7330645217', 'Back Waiter'),
		('188408772', 'Deanna', 'Doyle', '2023-06-12', '6102525534', 'Roast Chef'),
		('638416705', 'Adam', 'Mclaughlin', '2022-12-05', '7137892764', 'Busboy'),
		('190507419', 'Lauren', 'Merritt', '2019-12-02', '7922604253', 'Hosts'),
		('585877233', 'Jason', 'Gonzales', '2024-02-09', '6062921677', 'Busboy'),
		('406779105', 'Christian', 'Stokes', '2024-01-07', '3477797186', 'Busboy'),
		('980756358', 'James', 'Smith', '2019-04-19', '7678003384', 'Waiter'),
		('349948423', 'Amy', 'Anderson', '2019-12-15', '2172366214', 'Sous Chef'),
		('598375681', 'Jason', 'Martinez', '2020-05-25', '2748569951', 'Captain'),
		('073002757', 'Stephanie', 'Obrien', '2022-06-29', '1127276085', 'Hosts'),
		('815584893', 'Anthony', 'Alexander', '2023-11-05', '8853996178', 'Pastry Chef'),
		('289402279', 'Shane', 'Massey', '2022-11-25', '9965434077', 'Pastry Chef'),
		('895172204', 'Nicole', 'Hines', '2022-09-13', '8864403098', 'Executive Chef'),
		('580185721', 'Christopher', 'Brewer', '2020-03-18', '2348009283', 'Manager'),
		('226427673', 'Nicole', 'Andersen', '2020-11-26', '1852522785', 'Manager'),
		('202181886', 'Michele', 'Torres', '2023-05-05', '5146563361', 'Manager'),
		('928654994', 'Wesley', 'Baldwin', '2022-01-03', '5776679623', 'Manager'),
		('850110705', 'Alexandria', 'Young', '2020-05-09', '1806684215', 'Sommelier'),
		('458908518', 'Christian', 'Huerta', '2023-12-04', '2128614274', 'Sommelier'),
		('633776345', 'Jeffrey', 'Ferguson', '2024-01-26', '8791022895', 'Sommelier')
        ;


------------------------------

In [3]:
import datetime as dt

today = dt.date.today()
dteRange = dt.timedelta(weeks=6)
start = today - dteRange
end = today + dteRange


def getShift(date, earlyShift: bool = True):
    """This creates value arrays for inserts of Shifts"""
    return (str(date), "9:30 am" if earlyShift else "5:30 pm", "9h")


days = [start + dt.timedelta(days=i) for i in range((end - start).days)]
earlyShifts = [getShift(day) for day in days if day.weekday() != 0]
lateShifts = [getShift(day, earlyShift=False) for day in days if day.weekday() != 0]

shifts = earlyShifts + lateShifts
print(
    create_sql_insert(
        shifts, "thebestdbever.shift", ["Date", "StartTime", "Duration"], True
    )
)

------------------------------
-- thebestdbever.shift
------------------------------


DELETE
	FROM thebestdbever.shift
	WHERE Date IS NOT NULL;

INSERT INTO thebestdbever.shift(Date, StartTime, Duration)
	VALUES ('2024-03-01', '9:30 am', '9h'),
		('2024-03-02', '9:30 am', '9h'),
		('2024-03-03', '9:30 am', '9h'),
		('2024-03-05', '9:30 am', '9h'),
		('2024-03-06', '9:30 am', '9h'),
		('2024-03-07', '9:30 am', '9h'),
		('2024-03-08', '9:30 am', '9h'),
		('2024-03-09', '9:30 am', '9h'),
		('2024-03-10', '9:30 am', '9h'),
		('2024-03-12', '9:30 am', '9h'),
		('2024-03-13', '9:30 am', '9h'),
		('2024-03-14', '9:30 am', '9h'),
		('2024-03-15', '9:30 am', '9h'),
		('2024-03-16', '9:30 am', '9h'),
		('2024-03-17', '9:30 am', '9h'),
		('2024-03-19', '9:30 am', '9h'),
		('2024-03-20', '9:30 am', '9h'),
		('2024-03-21', '9:30 am', '9h'),
		('2024-03-22', '9:30 am', '9h'),
		('2024-03-23', '9:30 am', '9h'),
		('2024-03-24', '9:30 am', '9h'),
		('2024-03-26', '9:30 am', '9h'),
		('2024-03-27', '9:30 am', '9h'),
		('2024-03-28', '9:30 am', '9h'),
		('2024-03-29', '9:30 am', '9h'),
		('2024-03-30', '9:30 am', '9h'),
		('2024-03-31', '9:30 am', '9h'),
		('2024-04-02', '9:30 am', '9h'),
		('2024-04-03', '9:30 am', '9h'),
		('2024-04-04', '9:30 am', '9h'),
		('2024-04-05', '9:30 am', '9h'),
		('2024-04-06', '9:30 am', '9h'),
		('2024-04-07', '9:30 am', '9h'),
		('2024-04-09', '9:30 am', '9h'),
		('2024-04-10', '9:30 am', '9h'),
		('2024-04-11', '9:30 am', '9h'),
		('2024-04-12', '9:30 am', '9h'),
		('2024-04-13', '9:30 am', '9h'),
		('2024-04-14', '9:30 am', '9h'),
		('2024-04-16', '9:30 am', '9h'),
		('2024-04-17', '9:30 am', '9h'),
		('2024-04-18', '9:30 am', '9h'),
		('2024-04-19', '9:30 am', '9h'),
		('2024-04-20', '9:30 am', '9h'),
		('2024-04-21', '9:30 am', '9h'),
		('2024-04-23', '9:30 am', '9h'),
		('2024-04-24', '9:30 am', '9h'),
		('2024-04-25', '9:30 am', '9h'),
		('2024-04-26', '9:30 am', '9h'),
		('2024-04-27', '9:30 am', '9h'),
		('2024-04-28', '9:30 am', '9h'),
		('2024-04-30', '9:30 am', '9h'),
		('2024-05-01', '9:30 am', '9h'),
		('2024-05-02', '9:30 am', '9h'),
		('2024-05-03', '9:30 am', '9h'),
		('2024-05-04', '9:30 am', '9h'),
		('2024-05-05', '9:30 am', '9h'),
		('2024-05-07', '9:30 am', '9h'),
		('2024-05-08', '9:30 am', '9h'),
		('2024-05-09', '9:30 am', '9h'),
		('2024-05-10', '9:30 am', '9h'),
		('2024-05-11', '9:30 am', '9h'),
		('2024-05-12', '9:30 am', '9h'),
		('2024-05-14', '9:30 am', '9h'),
		('2024-05-15', '9:30 am', '9h'),
		('2024-05-16', '9:30 am', '9h'),
		('2024-05-17', '9:30 am', '9h'),
		('2024-05-18', '9:30 am', '9h'),
		('2024-05-19', '9:30 am', '9h'),
		('2024-05-21', '9:30 am', '9h'),
		('2024-05-22', '9:30 am', '9h'),
		('2024-05-23', '9:30 am', '9h'),
		('2024-03-01', '5:30 pm', '9h'),
		('2024-03-02', '5:30 pm', '9h'),
		('2024-03-03', '5:30 pm', '9h'),
		('2024-03-05', '5:30 pm', '9h'),
		('2024-03-06', '5:30 pm', '9h'),
		('2024-03-07', '5:30 pm', '9h'),
		('2024-03-08', '5:30 pm', '9h'),
		('2024-03-09', '5:30 pm', '9h'),
		('2024-03-10', '5:30 pm', '9h'),
		('2024-03-12', '5:30 pm', '9h'),
		('2024-03-13', '5:30 pm', '9h'),
		('2024-03-14', '5:30 pm', '9h'),
		('2024-03-15', '5:30 pm', '9h'),
		('2024-03-16', '5:30 pm', '9h'),
		('2024-03-17', '5:30 pm', '9h'),
		('2024-03-19', '5:30 pm', '9h'),
		('2024-03-20', '5:30 pm', '9h'),
		('2024-03-21', '5:30 pm', '9h'),
		('2024-03-22', '5:30 pm', '9h'),
		('2024-03-23', '5:30 pm', '9h'),
		('2024-03-24', '5:30 pm', '9h'),
		('2024-03-26', '5:30 pm', '9h'),
		('2024-03-27', '5:30 pm', '9h'),
		('2024-03-28', '5:30 pm', '9h'),
		('2024-03-29', '5:30 pm', '9h'),
		('2024-03-30', '5:30 pm', '9h'),
		('2024-03-31', '5:30 pm', '9h'),
		('2024-04-02', '5:30 pm', '9h'),
		('2024-04-03', '5:30 pm', '9h'),
		('2024-04-04', '5:30 pm', '9h'),
		('2024-04-05', '5:30 pm', '9h'),
		('2024-04-06', '5:30 pm', '9h'),
		('2024-04-07', '5:30 pm', '9h'),
		('2024-04-09', '5:30 pm', '9h'),
		('2024-04-10', '5:30 pm', '9h'),
		('2024-04-11', '5:30 pm', '9h'),
		('2024-04-12', '5:30 pm', '9h'),
		('2024-04-13', '5:30 pm', '9h'),
		('2024-04-14', '5:30 pm', '9h'),
		('2024-04-16', '5:30 pm', '9h'),
		('2024-04-17', '5:30 pm', '9h'),
		('2024-04-18', '5:30 pm', '9h'),
		('2024-04-19', '5:30 pm', '9h'),
		('2024-04-20', '5:30 pm', '9h'),
		('2024-04-21', '5:30 pm', '9h'),
		('2024-04-23', '5:30 pm', '9h'),
		('2024-04-24', '5:30 pm', '9h'),
		('2024-04-25', '5:30 pm', '9h'),
		('2024-04-26', '5:30 pm', '9h'),
		('2024-04-27', '5:30 pm', '9h'),
		('2024-04-28', '5:30 pm', '9h'),
		('2024-04-30', '5:30 pm', '9h'),
		('2024-05-01', '5:30 pm', '9h'),
		('2024-05-02', '5:30 pm', '9h'),
		('2024-05-03', '5:30 pm', '9h'),
		('2024-05-04', '5:30 pm', '9h'),
		('2024-05-05', '5:30 pm', '9h'),
		('2024-05-07', '5:30 pm', '9h'),
		('2024-05-08', '5:30 pm', '9h'),
		('2024-05-09', '5:30 pm', '9h'),
		('2024-05-10', '5:30 pm', '9h'),
		('2024-05-11', '5:30 pm', '9h'),
		('2024-05-12', '5:30 pm', '9h'),
		('2024-05-14', '5:30 pm', '9h'),
		('2024-05-15', '5:30 pm', '9h'),
		('2024-05-16', '5:30 pm', '9h'),
		('2024-05-17', '5:30 pm', '9h'),
		('2024-05-18', '5:30 pm', '9h'),
		('2024-05-19', '5:30 pm', '9h'),
		('2024-05-21', '5:30 pm', '9h'),
		('2024-05-22', '5:30 pm', '9h'),
		('2024-05-23', '5:30 pm', '9h')
        ;


------------------------------

In [6]:
def make_select_for_key(
    key: str,
    table: str,
    column: str = None,
    value: str = None,
    where_clause: str = None,
) -> str:
    """
    This creates a **SQL SELECT** statement from the given parameters.
    These are generally used inside the SQL INSERT statements created from create_sql_insert.
    :param key: The name of the column to select, or a **string** with the name of multiple columns to
        select separated by commas.
    :param table: The name of the table to select from.
    :param column: The name of the column to check against value.
    :param value: The value to check against. See _whereClause_.
    :param where_clause: If whereClause is specified and value and column are None then the whereClause will
        be inserted into the statement as is. This is useful when you need to check multiple values.
    :return: A string with the select statement.
    """
    if value is None and where_clause is None:
        raise Exception(
            "Cannot have value and whereClause both equal to 'None'. Either specify value or whereClause."
        )
    if column is None and value is not None:
        column = key

    if column is None and value is None:
        return f"raw: (SELECT {key} FROM {table} WHERE {where_clause})"
    else:
        return f"raw: (SELECT {key} FROM {table} WHERE {column} = '{value}')"


# Mgr, host, chef, bartender, waiter
earlyReq = [
    ["Manager"],
    ["Hosts"],
    ["Executive Chef", "Sous Chef", "Pastry Chef", "Roast Chef"],
    ["Bartender"],
    ["Captain", "Waiter", "Sommelier"],
]
# 'Runner',
# 'Back Waiter',
# 'Barback',
# 'Busboy',
# ]
lateReq = earlyReq.copy()
lateReq.append(("Sommelier"))


def flatten(*args):
    """This just flattens nested arrays."""
    retVal = []
    [retVal.extend(lst) for lst in args]
    return retVal


worksOnShift = []
# Change this if you want requirements satisfied.
randomAssignments = True
if not randomAssignments:
    raise "Need to add night shift stuff!"
    # display(empPosMap)
    earlyReqToSSN = [
        flatten(*[[(pos, ele) for ele in empPosMap[pos]] for pos in reqPos])
        for reqPos in earlyReq
    ]

    # This version makes sure requirements are satisfied.
    worksOnShift = flatten(
        *[
            [
                (
                    make_select_for_key(
                        "shiftid",
                        "shift",
                        where_clause=f"Date='{shift[0]}' AND StartTime='{shift[1]}'",
                    ),
                    (worker := fake.random_element(ssns))[1],
                )
                for ssns in earlyReqToSSN
            ]
            for shift in earlyShifts
        ]
    )
    print(
        create_sql_insert(
            worksOnShift,
            "works_on_shift",
            fields=("shiftId", "ssn"),
            genDelete="shiftid",
        )
    )
else:
    # This just fills in a bunch of random employees per shift
    allSsns = [e[0] for e in emps]
    numPerShift = range(7, 10)
    worksOnShift = [
        [
            (
                make_select_for_key(
                    "shiftid",
                    "shift",
                    where_clause=f"Date='{shift[0]}' AND StartTime='{shift[1]}'",
                ),
                ssns,
            )
            for ssns in fake.random_elements(
                allSsns, fake.random_element(numPerShift), unique=True
            )
        ]
        for shift in shifts[:-3]
    ]

    print(
        create_sql_insert(
            worksOnShift[0],
            "works_on_shift",
            fields=("shiftId", "ssn"),
            genDelete="shiftid",
        )
    )
    [
        print(
            create_sql_insert(
                wos,
                "works_on_shift",
                fields=("shiftId", "ssn"),
                genDelete=False,
                genTransaction=False,
                genComments=False,
            )
        )
        for wos in worksOnShift[1:]
    ]
# display(worksOnShift)

------------------------------
-- works_on_shift
------------------------------


DELETE
	FROM works_on_shift
	WHERE shiftid IS NOT NULL;

INSERT INTO works_on_shift(shiftId, ssn)
	VALUES ((SELECT shiftid FROM shift WHERE Date='2024-03-01' AND StartTime='9:30 am'), '073002757'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-01' AND StartTime='9:30 am'), '908354208'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-01' AND StartTime='9:30 am'), '091554149'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-01' AND StartTime='9:30 am'), '202181886'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-01' AND StartTime='9:30 am'), '438315184'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-01' AND StartTime='9:30 am'), '773922208'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-01' AND StartTime='9:30 am'), '776644943')
        ;


------------------------------
INSERT INTO works_on_shift(shiftId, ssn)
	VALUES ((SELECT shiftid FROM shift WHERE Date='2024-03-02' AND StartTime='9:30 am'), '454996158'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-02' AND StartTime='9:30 am'), '285189828'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-02' AND StartTime='9:30 am'), '980176700'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-02' AND StartTime='9:30 am'), '709351526'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-02' AND StartTime='9:30 am'), '923427923'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-02' AND StartTime='9:30 am'), '612657236'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-02' AND StartTime='9:30 am'), '349948423'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-02' AND StartTime='9:30 am'), '980756358'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-02' AND StartTime='9:30 am'), '801737668')
        ;
INSERT INTO works_on_shift(shiftId, ssn)
	VALUES ((SELECT shiftid FROM shift WHERE Date='2024-03-03' AND StartTime='9:30 am'), '250264699'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-03' AND StartTime='9:30 am'), '509198386'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-03' AND StartTime='9:30 am'), '349948423'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-03' AND StartTime='9:30 am'), '815584893'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-03' AND StartTime='9:30 am'), '282420502'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-03' AND StartTime='9:30 am'), '694952163'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-03' AND StartTime='9:30 am'), '741748404'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-03' AND StartTime='9:30 am'), '395875054'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-03' AND StartTime='9:30 am'), '998847352')
        ;
INSERT INTO works_on_shift(shiftId, ssn)
	VALUES ((SELECT shiftid FROM shift WHERE Date='2024-03-05' AND StartTime='9:30 am'), '881090008'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-05' AND StartTime='9:30 am'), '073002757'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-05' AND StartTime='9:30 am'), '895172204'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-05' AND StartTime='9:30 am'), '190507419'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-05' AND StartTime='9:30 am'), '163081250'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-05' AND StartTime='9:30 am'), '694952163'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-05' AND StartTime='9:30 am'), '431546005'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-05' AND StartTime='9:30 am'), '406779105')
        ;
INSERT INTO works_on_shift(shiftId, ssn)
	VALUES ((SELECT shiftid FROM shift WHERE Date='2024-03-06' AND StartTime='9:30 am'), '226427673'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-06' AND StartTime='9:30 am'), '298398393'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-06' AND StartTime='9:30 am'), '460366767'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-06' AND StartTime='9:30 am'), '660757419'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-06' AND StartTime='9:30 am'), '980176700'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-06' AND StartTime='9:30 am'), '438315184'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-06' AND StartTime='9:30 am'), '598375681')
        ;
INSERT INTO works_on_shift(shiftId, ssn)
	VALUES ((SELECT shiftid FROM shift WHERE Date='2024-03-07' AND StartTime='9:30 am'), '881090008'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-07' AND StartTime='9:30 am'), '077238802'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-07' AND StartTime='9:30 am'), '225735404'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-07' AND StartTime='9:30 am'), '207951523'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-07' AND StartTime='9:30 am'), '799995205'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-07' AND StartTime='9:30 am'), '549218587'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-07' AND StartTime='9:30 am'), '020015538')
        ;
INSERT INTO works_on_shift(shiftId, ssn)
	VALUES ((SELECT shiftid FROM shift WHERE Date='2024-03-08' AND StartTime='9:30 am'), '818508427'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-08' AND StartTime='9:30 am'), '228238223'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-08' AND StartTime='9:30 am'), '815584893'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-08' AND StartTime='9:30 am'), '460366767'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-08' AND StartTime='9:30 am'), '773922208'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-08' AND StartTime='9:30 am'), '922853432'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-08' AND StartTime='9:30 am'), '406779105'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-08' AND StartTime='9:30 am'), '799995205'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-08' AND StartTime='9:30 am'), '395875054')
        ;
INSERT INTO works_on_shift(shiftId, ssn)
	VALUES ((SELECT shiftid FROM shift WHERE Date='2024-03-09' AND StartTime='9:30 am'), '382483089'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-09' AND StartTime='9:30 am'), '048017726'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-09' AND StartTime='9:30 am'), '845824577'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-09' AND StartTime='9:30 am'), '209497253'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-09' AND StartTime='9:30 am'), '406779105'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-09' AND StartTime='9:30 am'), '038223326'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-09' AND StartTime='9:30 am'), '460366767'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-09' AND StartTime='9:30 am'), '035994879')
        ;
INSERT INTO works_on_shift(shiftId, ssn)
	VALUES ((SELECT shiftid FROM shift WHERE Date='2024-03-10' AND StartTime='9:30 am'), '850110705'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-10' AND StartTime='9:30 am'), '527276037'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-10' AND StartTime='9:30 am'), '559694621'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-10' AND StartTime='9:30 am'), '188408772'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-10' AND StartTime='9:30 am'), '438315184'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-10' AND StartTime='9:30 am'), '191197193'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-10' AND StartTime='9:30 am'), '727992852')
        ;
INSERT INTO works_on_shift(shiftId, ssn)
	VALUES ((SELECT shiftid FROM shift WHERE Date='2024-03-12' AND StartTime='9:30 am'), '928654994'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-12' AND StartTime='9:30 am'), '603287983'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-12' AND StartTime='9:30 am'), '190507419'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-12' AND StartTime='9:30 am'), '801737668'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-12' AND StartTime='9:30 am'), '443324088'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-12' AND StartTime='9:30 am'), '181290694'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-12' AND StartTime='9:30 am'), '987566801'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-12' AND StartTime='9:30 am'), '570564619'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-12' AND StartTime='9:30 am'), '188408772')
        ;
INSERT INTO works_on_shift(shiftId, ssn)
	VALUES ((SELECT shiftid FROM shift WHERE Date='2024-03-13' AND StartTime='9:30 am'), '202181886'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-13' AND StartTime='9:30 am'), '922853432'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-13' AND StartTime='9:30 am'), '038223326'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-13' AND StartTime='9:30 am'), '413533939'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-13' AND StartTime='9:30 am'), '312993563'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-13' AND StartTime='9:30 am'), '549218587'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-13' AND StartTime='9:30 am'), '406779105'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-13' AND StartTime='9:30 am'), '035994879'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-13' AND StartTime='9:30 am'), '020015538')
        ;
INSERT INTO works_on_shift(shiftId, ssn)
	VALUES ((SELECT shiftid FROM shift WHERE Date='2024-03-14' AND StartTime='9:30 am'), '406779105'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-14' AND StartTime='9:30 am'), '285189828'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-14' AND StartTime='9:30 am'), '788324562'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-14' AND StartTime='9:30 am'), '980176700'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-14' AND StartTime='9:30 am'), '512350123'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-14' AND StartTime='9:30 am'), '606035342'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-14' AND StartTime='9:30 am'), '282420502'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-14' AND StartTime='9:30 am'), '626483508')
        ;
INSERT INTO works_on_shift(shiftId, ssn)
	VALUES ((SELECT shiftid FROM shift WHERE Date='2024-03-15' AND StartTime='9:30 am'), '282420502'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-15' AND StartTime='9:30 am'), '850110705'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-15' AND StartTime='9:30 am'), '413533939'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-15' AND StartTime='9:30 am'), '163081250'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-15' AND StartTime='9:30 am'), '020015538'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-15' AND StartTime='9:30 am'), '559694621'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-15' AND StartTime='9:30 am'), '458908518'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-15' AND StartTime='9:30 am'), '188408772'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-15' AND StartTime='9:30 am'), '815584893')
        ;
INSERT INTO works_on_shift(shiftId, ssn)
	VALUES ((SELECT shiftid FROM shift WHERE Date='2024-03-16' AND StartTime='9:30 am'), '660757419'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-16' AND StartTime='9:30 am'), '181290694'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-16' AND StartTime='9:30 am'), '608875084'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-16' AND StartTime='9:30 am'), '928654994'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-16' AND StartTime='9:30 am'), '207951523'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-16' AND StartTime='9:30 am'), '250264699'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-16' AND StartTime='9:30 am'), '282420502')
        ;
INSERT INTO works_on_shift(shiftId, ssn)
	VALUES ((SELECT shiftid FROM shift WHERE Date='2024-03-17' AND StartTime='9:30 am'), '038223326'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-17' AND StartTime='9:30 am'), '559694621'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-17' AND StartTime='9:30 am'), '296057908'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-17' AND StartTime='9:30 am'), '549218587'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-17' AND StartTime='9:30 am'), '850110705'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-17' AND StartTime='9:30 am'), '048017726'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-17' AND StartTime='9:30 am'), '079301349')
        ;
INSERT INTO works_on_shift(shiftId, ssn)
	VALUES ((SELECT shiftid FROM shift WHERE Date='2024-03-19' AND StartTime='9:30 am'), '188408772'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-19' AND StartTime='9:30 am'), '626483508'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-19' AND StartTime='9:30 am'), '296057908'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-19' AND StartTime='9:30 am'), '694952163'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-19' AND StartTime='9:30 am'), '569080662'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-19' AND StartTime='9:30 am'), '438315184'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-19' AND StartTime='9:30 am'), '598375681')
        ;
INSERT INTO works_on_shift(shiftId, ssn)
	VALUES ((SELECT shiftid FROM shift WHERE Date='2024-03-20' AND StartTime='9:30 am'), '349948423'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-20' AND StartTime='9:30 am'), '458908518'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-20' AND StartTime='9:30 am'), '038223326'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-20' AND StartTime='9:30 am'), '312993563'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-20' AND StartTime='9:30 am'), '181290694'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-20' AND StartTime='9:30 am'), '788324562'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-20' AND StartTime='9:30 am'), '438315184'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-20' AND StartTime='9:30 am'), '002738355'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-20' AND StartTime='9:30 am'), '077238802')
        ;
INSERT INTO works_on_shift(shiftId, ssn)
	VALUES ((SELECT shiftid FROM shift WHERE Date='2024-03-21' AND StartTime='9:30 am'), '580185721'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-21' AND StartTime='9:30 am'), '077238802'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-21' AND StartTime='9:30 am'), '980756358'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-21' AND StartTime='9:30 am'), '512350123'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-21' AND StartTime='9:30 am'), '356026873'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-21' AND StartTime='9:30 am'), '250264699'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-21' AND StartTime='9:30 am'), '196669355')
        ;
INSERT INTO works_on_shift(shiftId, ssn)
	VALUES ((SELECT shiftid FROM shift WHERE Date='2024-03-22' AND StartTime='9:30 am'), '458908518'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-22' AND StartTime='9:30 am'), '406779105'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-22' AND StartTime='9:30 am'), '282420502'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-22' AND StartTime='9:30 am'), '980756358'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-22' AND StartTime='9:30 am'), '413533939'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-22' AND StartTime='9:30 am'), '815584893'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-22' AND StartTime='9:30 am'), '296057908'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-22' AND StartTime='9:30 am'), '050101581'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-22' AND StartTime='9:30 am'), '038223326')
        ;
INSERT INTO works_on_shift(shiftId, ssn)
	VALUES ((SELECT shiftid FROM shift WHERE Date='2024-03-23' AND StartTime='9:30 am'), '626483508'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-23' AND StartTime='9:30 am'), '290980577'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-23' AND StartTime='9:30 am'), '298398393'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-23' AND StartTime='9:30 am'), '431546005'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-23' AND StartTime='9:30 am'), '957390053'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-23' AND StartTime='9:30 am'), '382483089'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-23' AND StartTime='9:30 am'), '349948423')
        ;
INSERT INTO works_on_shift(shiftId, ssn)
	VALUES ((SELECT shiftid FROM shift WHERE Date='2024-03-24' AND StartTime='9:30 am'), '438315184'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-24' AND StartTime='9:30 am'), '815584893'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-24' AND StartTime='9:30 am'), '002738355'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-24' AND StartTime='9:30 am'), '922853432'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-24' AND StartTime='9:30 am'), '895172204'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-24' AND StartTime='9:30 am'), '799995205'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-24' AND StartTime='9:30 am'), '290980577')
        ;
INSERT INTO works_on_shift(shiftId, ssn)
	VALUES ((SELECT shiftid FROM shift WHERE Date='2024-03-26' AND StartTime='9:30 am'), '191197193'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-26' AND StartTime='9:30 am'), '181290694'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-26' AND StartTime='9:30 am'), '382483089'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-26' AND StartTime='9:30 am'), '282420502'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-26' AND StartTime='9:30 am'), '209497253'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-26' AND StartTime='9:30 am'), '750826949'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-26' AND StartTime='9:30 am'), '606035342')
        ;
INSERT INTO works_on_shift(shiftId, ssn)
	VALUES ((SELECT shiftid FROM shift WHERE Date='2024-03-27' AND StartTime='9:30 am'), '509198386'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-27' AND StartTime='9:30 am'), '356026873'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-27' AND StartTime='9:30 am'), '606035342'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-27' AND StartTime='9:30 am'), '079301349'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-27' AND StartTime='9:30 am'), '285189828'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-27' AND StartTime='9:30 am'), '915952606'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-27' AND StartTime='9:30 am'), '881090008'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-27' AND StartTime='9:30 am'), '549218587'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-27' AND StartTime='9:30 am'), '190507419')
        ;
INSERT INTO works_on_shift(shiftId, ssn)
	VALUES ((SELECT shiftid FROM shift WHERE Date='2024-03-28' AND StartTime='9:30 am'), '196669355'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-28' AND StartTime='9:30 am'), '077238802'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-28' AND StartTime='9:30 am'), '549218587'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-28' AND StartTime='9:30 am'), '633776345'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-28' AND StartTime='9:30 am'), '585877233'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-28' AND StartTime='9:30 am'), '922853432'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-28' AND StartTime='9:30 am'), '406779105')
        ;
INSERT INTO works_on_shift(shiftId, ssn)
	VALUES ((SELECT shiftid FROM shift WHERE Date='2024-03-29' AND StartTime='9:30 am'), '694952163'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-29' AND StartTime='9:30 am'), '580185721'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-29' AND StartTime='9:30 am'), '312993563'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-29' AND StartTime='9:30 am'), '608875084'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-29' AND StartTime='9:30 am'), '337063900'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-29' AND StartTime='9:30 am'), '050101581'),
		((SELECT shiftid FROM shift WHERE Date='2024-03-29' AND StartTime='9:30 am'), '915952606')
        ;